## Data Types
-  qualitative and quantitative (or numeric). 
-  Each is broken down into two sub-types: qualitative data can be ordinal or nominal,
-  and numeric data can be discrete (often, integer) or continuous.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# nominal Data types
#  nominal if there is no natural order between the categories (eg eye colour), or 

rainBow_colors=["red","blue","black","yellow","green"]
df=pd.DataFrame(rainBow_colors)
df

        0
0     red
1    blue
2   black
3  yellow
4   green

In [3]:
#ordinal_data
collage_mark=["first","second","third","foutrh"]
pd.DataFrame(collage_mark)

        0
0   first
1  second
2   third
3  foutrh

## numerical Data

##  Discrete Data
- Typically it involves integers. For instance, the number of children (or adults, or pets) in your family is discrete data, because you are counting whole, indivisible entities: you can't have 2.5 kids, or 1.3 pets

##  Continious Data
- For example, you can measure the height of your kids at progressively more precise scales—meters, centimeters, millimeters, and beyond—so height is continuous data.

In [4]:
# Discrete data
population_tiger=10000
print(population_tiger)

10000

In [6]:
# continious data
height_of_womens_world=[5.4,6.3,4.8,2.4]
print(height_of_womens_world)

[5.4, 6.3, 4.8, 2.4]

In [1]:
import pandas as pd
import numpy as np

In [4]:
data=pd.read_csv('D:/Datasets/titanic/train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## column names

In [6]:
columns_names=data.columns
columns_names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## categorical columns

In [13]:
data1=data
cat_columns=data1.select_dtypes(include=['O']).columns.values
cat_data=data1[cat_columns]
cat_data.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

## numerical columns

In [9]:
categorical_data=data._get_numeric_data()
categorical_data.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500